const map = new Map([

    // Kyrillisch (Kleinbuchstaben)
    ["а", "a"],
    ["е", "e"],
    ["о", "o"],
    ["р", "p"],
    ["с", "c"],
    ["х", "x"],
    ["у", "y"],
    ["к", "k"],
    ["м", "m"],
    ["т", "t"],
    ["і", "i"],
    ["ј", "j"],
    ["ѕ", "s"],
    ["ԛ", "q"],

    // Kyrillisch (Großbuchstaben)
    ["А", "A"],
    ["В", "B"],
    ["Е", "E"],
    ["К", "K"],
    ["М", "M"],
    ["Н", "H"],
    ["О", "O"],
    ["Р", "P"],
    ["С", "C"],
    ["Т", "T"],
    ["Х", "X"],
    ["У", "Y"],

    // Griechisch
    ["Α", "A"],
    ["Β", "B"],
    ["Ε", "E"],
    ["Ζ", "Z"],
    ["Η", "H"],
    ["Ι", "I"],
    ["Κ", "K"],
    ["Μ", "M"],
    ["Ν", "N"],
    ["Ο", "O"],
    ["Ρ", "P"],
    ["Τ", "T"],
    ["Υ", "Y"],
    ["Χ", "X"],

    ["α", "a"],
    ["β", "b"],
    ["γ", "y"],
    ["δ", "d"],
    ["ε", "e"],
    ["ι", "i"],
    ["κ", "k"],
    ["ν", "v"],
    ["ο", "o"],
    ["ρ", "p"],
    ["τ", "t"],
    ["υ", "u"],
    ["χ", "x"]

]);

function replaceHomoglyphs(text = "") {

    return [...text]
        .map(char => map.get(char) ?? char)
        .join("");

}

module.exports = replaceHomoglyphs;